#include	"SYSCFG.h"
#include 	"FT60F21X.h"
#include "CX588.h"
/*-------------------------------------------------
 * 函数名：POWER_INITIAL
 * 功能： 上电系统初始化
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{ 
	OSCCON = 0B01110001;	//16MHz 1:1
	INTCON = 0;  			//暂禁止所有中断
    
	OPTION = 0;
    TRISA = 0;				//1:输入 0:输出 
    PSRCA = 0;				//00:4mA	01/10:8mA	11:28mA	bit[3:2]控制PA5源电流	bit[1:0]控制PA4源电流
    PSINKA = 0;				//bit[1:0]	控制PA5和PA4 0:灌电流最小 1:灌电流最大
    PORTA = 0;				//1:PAx输出高电平	0:PAx输出低电平	
 	WPUA = 0;				//1:使能PA口上拉	0:关闭PA口上拉  
}
/*-------------------------------------------------
 * 函数名：main 
 * 功能：  主函数
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/
void main()
{
 	POWER_INITIAL();		//系统初始化
    CX588_GPIO_Init();		//初始化CX588
	while(1)
	{

	}   
}
